# Cable Size Duplicate Method

Source: https://www.revitapidocs.com/2026/dfb61750-0883-ea96-b8ca-18da581ac7ac.htm

---

| Cable Size Duplicate Method |
| --- |

Duplicates this Cable Size.
**Namespace:** Autodesk.Revit.DB.Electrical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public CableSize Duplicate()
```

```
Public Function Duplicate As CableSize
```

```
public:
CableSize^ Duplicate()
```

```
member Duplicate : unit -> CableSize
```

#### Return Value

CableSize
The duplicated Cable Size data. See Also

#### Reference

CableSize Class Autodesk.Revit.DB.Electrical Namespace